[
    {
        "name":"TSTetris",
        "pageContent":"Coming soon!",
        "image":"Upcoming-game.jpg",
        "githubLink":"https://github.com/MadeOfBees",
        "new" : true
    },
    {
        "name": "Daily-Global-Sudoku",
        "pageContent" : "Daily Global Sudoku is a modern port of the classic game Sudoku. The game is built using the popular JavaScript library React, which provides a seamless and fast-paced gaming experience. The game's sleek and polished look is achieved through the use of Material-UI, a popular styling library. The game's daily puzzle update feature, powered by a server and a MongoDB database, ensures that players are never bored and can enjoy a fresh and challenging puzzle every day. Deployed on the Heroku cloud platform, the game offers high availability and scalability, ensuring that users can access the game anytime and anywhere. The game also features a leaderboard where players can compare their scores with their friends and add an element of competition to the game. Whether you are a fan of the classic game of Sudoku or are just looking for a new and challenging puzzle, then try out Daily Global Sudoku today!",
        "image": "Daily-Global-Sudoku.jpg",
        "githubLink": "https://github.com/MadeOfBees/DailySudoku/",
        "deployedLink": "https://daily-global-sudoku.herokuapp.com/"
    },
    {
        "name": "ReactJack",
        "pageContent" : "Built with the React framework, Reactjack is a JS port of the classic game Blackjack, The design is minimal and like all my other newer webapps supports both light and dark modes thanks to the use of Material UI. Whether you're a seasoned Blackjack player or just looking to try something new, this game offers hours of entertainment and challenge. The game is also fully responsive, so you can play it on your phone, tablet or desktop, so give it a try today!",
        "image": "ReactJack.jpg",
        "githubLink": "https://github.com/MadeOfBees/ReactJack",
        "deployedLink": "https://madeofbees.github.io/ReactJack/"
    },
    {
        "name": "JShutTheBox",
        "pageContent" : "A simple javascript port of the classic game Shut The Box, made with materialUI and React.",
        "image": "JShutTheBox.jpg",
        "githubLink": "https://github.com/MadeOfBees/JShutTheBox",
        "deployedLink": "https://madeofbees.github.io/JShutTheBox/"
    },
    {
        "name":"SQLStore",
        "pageContent":"This simple storefront is built with Sequelize/MySQL, Express, and NodeJS, making it a powerful and efficient platform for all your store's needs. This backend is designed to be a REST API, providing easy access to all the essential features of an online store, without the need for a front-end interface.",
        "image":"SQLStore.jpg",
        "githubLink":"https://github.com/MadeOfBees/SQLStore"
    },
    {
        "name":"Rouletteo",
        "pageContent":"Just input a .xlsx file and we'll pick a random row for you. Made with React and MaterialUI.",
        "image":"Rouletteo.jpg",
        "githubLink":"https://github.com/MadeOfBees/Rouletteo",
        "deployedLink":"https://madeofbees.github.io/Rouletteo/"
    },
    {
        "name":"Fighting-Time",
        "pageContent":"Coming soon!",
        "image":"Upcoming-game.jpg",
        "githubLink":"https://github.com/MadeOfBees/fighting-time",
        "new" : true
    }
]
